FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_Расчет_ЗП_Фин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТ_Расчет_ЗП_Фин</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТ_УПР_ЗП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИзРегистра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Планы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БрендыДляРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыОСАГО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыСтраховки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрограммаСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрограммыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтрахования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховаяКомпания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ТТ_ВариантыСтрахователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыБанки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыПролонгация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ТТ_ПланыЗП_ФИН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТ_ПланыЗП_ФИН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Премия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БрендыДляРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрограммыСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтрахования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ТТ_ВариантыСтрахователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_Расчет_ЗП_Фин/Ext/ObjectModule.bsl
Функция ПроверкаВвода();
	Рез = истина;
	ТЗ = Сотрудники.Выгрузить(,"Сотрудник");
	 ТЗ.Свернуть("Сотрудник");
	 Если ТЗ.Количество()<>Сотрудники.Количество() тогда
		 сообщить("Сотрудник введен повторно! Проведение невозможно! ");
		 Рез = Ложь;
	КонецЕсли; 
	Возврат рез;
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроверкаВвода();
	Если НЕ ПроверкаВВода() тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Движения.ТТ_УПР_ЗП.Записывать = Истина;
	Движения.ТТ_УПР_ЗП.Очистить();
	ДатаДвижения = КонецДня(ПериодКонец);

	Для каждого Стр из Планы цикл
		Если Стр.Сумма = 0 тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = Стр.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Организация = Стр.Организация;
		Движение.Бренд = Стр.Бренд;
		Движение.ФинЗП = Стр.Сумма;
	КонецЦикла;
	
	
	Для каждого Стр из ПланыОСАГО цикл
		Если Стр.Сумма = 0 тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = Стр.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Организация = Движение.Сотрудник.Организация;
		Движение.ФинЗП = Стр.Сумма;
	КонецЦикла;

	Для каждого Стр из ПланыСтраховки цикл
		Если Стр.Сумма = 0 тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = Стр.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Организация = Движение.Сотрудник.Организация;
		Движение.ФинЗП = Стр.Сумма;
	КонецЦикла;

	Для каждого Стр из ПланыБанки цикл
		Если Стр.Сумма = 0 тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = Стр.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Организация = Движение.Сотрудник.Организация;
		Движение.ФинЗП = Стр.Сумма;
	КонецЦикла;

	Для каждого Стр из ПланыПролонгация цикл
		Если Стр.Сумма = 0 тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = Стр.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Организация = Движение.Сотрудник.Организация;
		Движение.ФинЗП = Стр.Сумма;
	КонецЦикла;

КонецПроцедуры
	
Процедура Расчитать() Экспорт
	Для Каждого Стр ИЗ Сотрудники Цикл
		СуммаПлан = РасчитатьПлан(Стр.Сотрудник);
		СуммаПланОСАГО = РасчитатьПланОСАГО(Стр.Сотрудник);
		СуммаПланСтрах = РасчитатьСтрах(Стр.Сотрудник);
		СуммаПланБАНК = РасчитатьБанк(Стр.Сотрудник);
		СуммаПланПролонгация = РасчитатьПланПролонгация(Стр.Сотрудник);
		Стр.Сумма=СуммаПлан + СуммаПланОСАГО + СуммаПланСтрах + СуммаПланБАНК + СуммаПланПролонгация;
	КонецЦикла;	
КонецПроцедуры

Функция РасчитатьПлан(Сотрудник)
	СуммаИтого = 0;
	СтруктураДляПоиска = Новый Структура("Сотрудник", Сотрудник); 
	МассивПустыхСтрок = Планы.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивПустыхСтрок Цикл 
		Планы.Удалить(Строка); 
	КонецЦикла; 	
	
	
	Параметр=Новый СписокЗначений;
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.АВКВ);
	
	Запрос= Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Организация,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Бренд,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Параметр,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Значение,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Премия
	|ИЗ
	|	РегистрСведений.ТТ_ПланыЗП_ФИН.СрезПоследних(&Дата, ) КАК ТТ_ПланыЗП_ФИНСрезПоследних
	|ГДЕ
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Сотрудник = &Сотрудник
	|	И ТТ_ПланыЗП_ФИНСрезПоследних.Параметр В(&Параметр)
	|";
	Запрос.Параметры.Вставить("Дата", КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
	Запрос.Параметры.Вставить("Параметр", Параметр); // <Не определено>[]
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник); // <Сотрудники>[], Справочники.Сотрудники.ПустаяСсылка();
	
	Рез=Запрос.Выполнить().Выбрать();
	
	
	Пока Рез.Следующий() Цикл
		Стр=Планы.Добавить();
		Стр.Сотрудник=Сотрудник;
		Стр.Бренд=Рез.Бренд;
		Стр.Организация=Рез.Организация;
	//	Стр.Параметр=Рез.Параметр;
		Стр.План=Рез.Значение;
		Стр.Премия=Рез.Премия;
		Стр.Факт=ПолучитьФактП(Рез.Бренд,Рез.Организация,Рез.Параметр,Сотрудник);
		Если Не РасчетИЗРегистра тогда
			Стр.К=РасчитатьК_Программно(Стр.План,Стр.Факт);
		Иначе
			Стр.К=РасчитатьК_ИзРегистра(Стр.План,Стр.Факт, Рез.Параметр);
		КонецЕсли;
		Стр.Сумма=Стр.Премия*Стр.К;
		СуммаИтого = СуммаИтого + Стр.Сумма;
	КонецЦикла;	
	Возврат СуммаИтого;
КонецФункции	

Функция РасчитатьПланОСАГО(Сотрудник)
	СуммаИтого = 0;
	СтруктураДляПоиска = Новый Структура("Сотрудник", Сотрудник); 
	МассивПустыхСтрок = ПланыОСАГО.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивПустыхСтрок Цикл 
		ПланыОСАГО.Удалить(Строка); 
	КонецЦикла; 	
	
	
	Параметр=Новый СписокЗначений;
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.ОСАГО);
	
	Запрос= Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Организация,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Бренд,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Параметр,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Значение,
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Премия
	|ИЗ
	|	РегистрСведений.ТТ_ПланыЗП_ФИН.СрезПоследних(&Дата, ) КАК ТТ_ПланыЗП_ФИНСрезПоследних
	|ГДЕ
	|	ТТ_ПланыЗП_ФИНСрезПоследних.Сотрудник = &Сотрудник
	|	И ТТ_ПланыЗП_ФИНСрезПоследних.Параметр В(&Параметр)
	|";
	Запрос.Параметры.Вставить("Дата", КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
	Запрос.Параметры.Вставить("Параметр", Параметр); // <Не определено>[]
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник); // <Сотрудники>[], Справочники.Сотрудники.ПустаяСсылка();
	
	Рез=Запрос.Выполнить().Выбрать();
	
	
	Пока Рез.Следующий() Цикл
		Стр=ПланыОСАГО.Добавить();
		Стр.Сотрудник=Сотрудник;
		Стр.План=Рез.Значение;
		Стр.Премия=Рез.Премия;
		Стр.Факт=ПолучитьФактП(Рез.Бренд,Рез.Организация,Рез.Параметр,Сотрудник);
		Если Не РасчетИЗРегистра тогда
			Стр.К=РасчитатьК_Программно(Стр.План,Стр.Факт);
		Иначе
			Стр.К=РасчитатьК_ИзРегистра(Стр.План,Стр.Факт, Рез.Параметр);
		КонецЕсли;
		Стр.Сумма=Стр.Премия*Стр.К;
		СуммаИтого = СуммаИтого + Стр.Сумма;
	КонецЦикла;	
	Возврат СуммаИтого;
КонецФункции

Функция РасчитатьПланПролонгация(Сотрудник)
	СуммаИтого = 0;
	СтруктураДляПоиска = Новый Структура("Сотрудник", Сотрудник); 
	МассивПустыхСтрок = ПланыПролонгация.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивПустыхСтрок Цикл 
		ПланыПролонгация.Удалить(Строка); 
	КонецЦикла; 	
	Запрос= Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Параметр,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Значение
	             |ИЗ
	             |	РегистрСведений.ТТ_ПланыЗП_ФИН.СрезПоследних(&Дата, ) КАК ТТ_ПланыЗП_ФИНСрезПоследних
	             |ГДЕ
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Сотрудник = &Сотрудник
	             |	И ТТ_ПланыЗП_ФИНСрезПоследних.Параметр В(&Параметр)";
	Запрос.Параметры.Вставить("Дата", КонецДня(ПериодКонец)); 	
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник);
	
	Параметр=Новый СписокЗначений;
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.Пролонгация);
	
	Запрос.Параметры.Вставить("Параметр", Параметр); 
	Рез=Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Стр=ПланыПролонгация.Добавить();
		Стр.Сотрудник=Сотрудник;
		Стр.Параметр=Рез.Параметр;
		Стр.План=Рез.Значение;
		Стр.Факт=ПолучитьФактПролонгация(Сотрудник,  1);
		Стр.Сумма=Стр.Факт*Стр.План/100;
		СуммаИтого = СуммаИтого + Стр.Сумма;
	КонецЦикла;	

	Возврат СуммаИтого;
КонецФункции

Функция РасчитатьСтрах(Сотрудник)
	СуммаИтого = 0;
	СтруктураДляПоиска = Новый Структура("Сотрудник", Сотрудник); 
	МассивПустыхСтрок = ПланыСтраховки.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивПустыхСтрок Цикл 
		ПланыСтраховки.Удалить(Строка); 
	КонецЦикла; 	
	
	Запрос= Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Параметр,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Значение,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.ПрограммаСтрахования,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.ВидСтрахования,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.СтраховаяКомпания,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Премия
	             |ИЗ
	             |	РегистрСведений.ТТ_ПланыЗП_ФИН.СрезПоследних(&Дата, ) КАК ТТ_ПланыЗП_ФИНСрезПоследних
	             |ГДЕ
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Сотрудник = &Сотрудник
	             |	И ТТ_ПланыЗП_ФИНСрезПоследних.Параметр В(&Параметр)";
	Запрос.Параметры.Вставить("Дата", КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
//	Запрос.Параметры.Вставить("Параметр", ТИП(Справочник.ПрограммыСтрахования)); // <Не определено>[]
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник); // <Сотрудники>[], Справочники.Сотрудники.ПустаяСсылка();
	
	Параметр=Новый СписокЗначений;
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.СтрахованиеСумма);
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.СтрахованиеШт);
	
	Запрос.Параметры.Вставить("Параметр", Параметр); // <Не определено>[]

	Рез=Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Стр=ПланыСтраховки.Добавить();
		Стр.Сотрудник=Сотрудник;
		Стр.ПрограммаСтрахования=Рез.ПрограммаСтрахования;
		Стр.ВидСтрахования=Рез.ВидСтрахования;
		Стр.СтраховаяКомпания = Рез.СтраховаяКомпания;
		Стр.Параметр=Рез.Параметр;
		Стр.План=Рез.Значение;
		Стр.Факт=ПолучитьФактСтрах(Сотрудник,Стр.ПрограммаСтрахования,Стр.ВидСтрахования, Стр.СтраховаяКомпания, Рез.Параметр, 1);
		Стр.Премия=Рез.Премия;
		Если Не РасчетИЗРегистра тогда
			Стр.К=РасчитатьК_Программно(Стр.План,Стр.Факт);
		Иначе
			Стр.К=РасчитатьК_ИзРегистра(Стр.План,Стр.Факт, Рез.Параметр);
		КонецЕсли;
		Стр.Сумма=Стр.Премия*Стр.К;
		СуммаИтого = СуммаИтого + Стр.Сумма;
	КонецЦикла;	
	Возврат СуммаИтого;
КонецФункции	

Функция РасчитатьБанк(Сотрудник)
	ИтогоСумма = 0;
	СтруктураДляПоиска = Новый Структура("Сотрудник", Сотрудник); 
	МассивПустыхСтрок = ПланыБанки.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивПустыхСтрок Цикл 
		ПланыБанки.Удалить(Строка); 
	КонецЦикла; 	
	
	
	Запрос= Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Параметр,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Значение,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Банк,
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Премия
	             |ИЗ
	             |	РегистрСведений.ТТ_ПланыЗП_ФИН.СрезПоследних(&Дата, ) КАК ТТ_ПланыЗП_ФИНСрезПоследних
	             |ГДЕ
	             |	ТТ_ПланыЗП_ФИНСрезПоследних.Сотрудник = &Сотрудник
	             |	И ТТ_ПланыЗП_ФИНСрезПоследних.Параметр В(&Параметр)";
	
	Параметр=Новый СписокЗначений;
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.БанкиСумма);
	Параметр.Добавить(Перечисления.ТТ_Параметры_ЗП_Фин.БанкиШтуки);
	
	Запрос.Параметры.Вставить("Дата", КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
	Запрос.Параметры.Вставить("Параметр", Параметр); 
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник); // <Сотрудники>[], Справочники.Сотрудники.ПустаяСсылка();
	
	Рез=Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Стр=ПланыБанки.Добавить();
		Стр.Сотрудник=Сотрудник;
		Стр.Банк=Рез.Банк;
		Стр.План=Рез.Значение;
		Стр.Параметр=Рез.Параметр;
		Стр.Факт=ПолучитьФактБанк(Сотрудник,Стр.Банк, Рез.Параметр, 1);
		Стр.Премия=Рез.Премия;
		Если Не РасчетИЗРегистра тогда
			Стр.К=РасчитатьК_Программно(Стр.План,Стр.Факт);
		Иначе
			Стр.К=РасчитатьК_ИзРегистра(Стр.План,Стр.Факт, Рез.Параметр);
		КонецЕсли;
		Стр.Сумма=Стр.Премия*Стр.К;
		ИтогоСумма = ИтогоСумма + Стр.Сумма;
	КонецЦикла;	
	Возврат ИтогоСумма;
КонецФункции	

Функция ПолучитьФактСтрах(Сотрудник,ПрограммаСтрах, ВидСтрахования,СтраховаяКомпания, Параметр, ПараметрВозвращения) Экспорт
	    
	Если Параметр = Перечисления.ТТ_Параметры_ЗП_Фин.СтрахованиеСумма тогда
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка КАК Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|ГДЕ
		|	(&ПрограммаСтрахования = ЗНАЧЕНИЕ(СПРАВОЧНИК.ПрограммыСтрахования.ПустаяСсылка)
		|			ИЛИ РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования = &ПрограммаСтрахования)
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = &Проведен
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Менеджер = &Менеджер
		|	И (&ВидСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыСтрахования.ПустаяСсылка)
		|			ИЛИ РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = &ВидСтрахования) &УсловиеПоСтраховщику
		|ИТОГИ
		|	Сумма(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии)
		|ПО
		|	ОБЩИЕ";

		Запрос.Параметры.Вставить("ДатаК",  КонецДня(ПериодКонец)); 
		Запрос.Параметры.Вставить("ДатаН", НачалоДня(ПериодНачало)); 
		Запрос.Параметры.Вставить("Менеджер", Сотрудник); 
		Запрос.Параметры.Вставить("Проведен", Истина); 
		Запрос.Параметры.Вставить("Статус", Справочники.СтатусыРабочегоЛиста.Создан); 
		Запрос.Параметры.Вставить("ПрограммаСтрахования", ПрограммаСтрах);
		Запрос.Параметры.Вставить("ВидСтрахования", ВидСтрахования);
		
		Если СтраховаяКомпания = Неопределено тогда
			ТекстУсловия = "";
		ИначеЕсли ТипЗНЧ(СтраховаяКомпания) = Тип("СправочникСсылка.Контрагенты") тогда
			ТекстУсловия = Символы.ПС + "И РабочийЛистОтделаСтрахованияВариантыСтрахования.Страховщик = &СтраховаяКомпания";
			Запрос.Параметры.Вставить("СтраховаяКомпания", СтраховаяКомпания);
		ИначеЕсли ТипЗНЧ(СтраховаяКомпания) = Тип("СправочникСсылка.ТТ_ВариантыСтрахователей") тогда
			СписокСтраховщиков = Новый СписокЗначений();
			СписокСтраховщиков.ЗагрузитьЗначения(СтраховаяКомпания.СтраховыеКомпании.ВыгрузитьКолонку("СтраховаяКомпания"));
			ТекстУсловия = Символы.ПС + "И РабочийЛистОтделаСтрахованияВариантыСтрахования.Страховщик В(&СтраховаяКомпания)";
			Запрос.Параметры.Вставить("СтраховаяКомпания", СписокСтраховщиков);
		КонецЕсли;	
        Запрос.Текст=СтрЗаменить(Запрос.Текст, "&УсловиеПоСтраховщику", ТекстУсловия+Символы.ПС);
		
		Если ПараметрВозвращения = 1 тогда
			Рез=Запрос.Выполнить().Выбрать();
			Сумма=0;
			Пока Рез.Следующий() Цикл
				Сумма=Рез.СуммаПремии;
				Прервать;
			КонецЦикла;	
			
			Возврат Сумма
		ИначеЕсли ПараметрВозвращения = 2 тогда
			ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
			Возврат ТаблицаРезультата;
		КонецЕсли;
		
	ИначеЕсли Параметр = Перечисления.ТТ_Параметры_ЗП_Фин.СтрахованиеШт тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|ГДЕ
		|	(&ПрограммаСтрахования = ЗНАЧЕНИЕ(СПРАВОЧНИК.ПрограммыСтрахования.ПустаяСсылка)
		|			ИЛИ РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования = &ПрограммаСтрахования)
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = &Проведен
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Менеджер = &Менеджер
		|	И (&ВидСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыСтрахования.ПустаяСсылка)
		|			ИЛИ РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = &ВидСтрахования) &УсловиеПоСтраховщику
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
		|ПО
		|	ОБЩИЕ";
		Запрос.Параметры.Вставить("ДатаК",  КонецДня(ПериодКонец)); 
		Запрос.Параметры.Вставить("ДатаН", НачалоДня(ПериодНачало)); 
		Запрос.Параметры.Вставить("Менеджер", Сотрудник); 
		Запрос.Параметры.Вставить("Проведен", Истина); 
		Запрос.Параметры.Вставить("Статус", Справочники.СтатусыРабочегоЛиста.Создан); 
		Запрос.Параметры.Вставить("ПрограммаСтрахования", ПрограммаСтрах);
		Запрос.Параметры.Вставить("ВидСтрахования", ВидСтрахования);
		
		Если СтраховаяКомпания = Неопределено тогда
			ТекстУсловия = "";
		ИначеЕсли ТипЗНЧ(СтраховаяКомпания) = Тип("СправочникСсылка.Контрагенты") тогда
			ТекстУсловия = Символы.ПС + "И РабочийЛистОтделаСтрахованияВариантыСтрахования.Страховщик = &СтраховаяКомпания";
			Запрос.Параметры.Вставить("СтраховаяКомпания", СтраховаяКомпания);
		ИначеЕсли ТипЗНЧ(СтраховаяКомпания) = Тип("СправочникСсылка.ТТ_ВариантыСтрахователей") тогда
			СписокСтраховщиков = Новый СписокЗначений();
			СписокСтраховщиков.ЗагрузитьЗначения(СтраховаяКомпания.СтраховыеКомпании.ВыгрузитьКолонку("СтраховаяКомпания"));
			ТекстУсловия = Символы.ПС + "И РабочийЛистОтделаСтрахованияВариантыСтрахования.Страховщик В(&СтраховаяКомпания)";
			Запрос.Параметры.Вставить("СтраховаяКомпания", СписокСтраховщиков);
		КонецЕсли;	
        Запрос.Текст=СтрЗаменить(Запрос.Текст, "&УсловиеПоСтраховщику", ТекстУсловия+Символы.ПС);
		
		Если ПараметрВозвращения = 1 тогда
			Рез=Запрос.Выполнить().Выбрать();
			КолВо=0;
			Пока Рез.Следующий() Цикл
				КолВо=Рез.Ссылка;
				Прервать;
			КонецЦикла;	
			
			Возврат КолВо
		ИначеЕсли ПараметрВозвращения =2 тогда
			ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
			Возврат ТаблицаРезультата;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьФактПролонгация(Сотрудник,ПараметрВозвращения) Экспорт
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код <> ""ЦБ000017""
		|			ТОГДА ВЫРАЗИТЬ(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии - РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии / 120 * 20 КАК ЧИСЛО(10, 2))
		|		ИНАЧЕ РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии - РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|	КОНЕЦ КАК КВ
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = &Проведен
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация = &ЭтоПролонгация
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Менеджер = &Менеджер
		|ИТОГИ
		|	СУММА(КВ)
		|ПО
		|	ОБЩИЕ";

		Запрос.Параметры.Вставить("ДатаК",  КонецДня(ПериодКонец)); 
		Запрос.Параметры.Вставить("ДатаН", НачалоДня(ПериодНачало)); 
		Запрос.Параметры.Вставить("Проведен", Истина); 
		Запрос.Параметры.Вставить("Статус", Справочники.СтатусыРабочегоЛиста.Создан); 
		Запрос.Параметры.Вставить("ЭтоПролонгация", Истина);
		Запрос.Параметры.Вставить("Менеджер", Сотрудник);
		
		Если ПараметрВозвращения = 1 тогда
			Рез=Запрос.Выполнить().Выбрать();
			Сумма=0;
			Пока Рез.Следующий() Цикл
				Сумма=Рез.КВ;
				Прервать;
			КонецЦикла;	
			Возврат Сумма
		ИначеЕсли ПараметрВозвращения = 2 тогда
			ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
			Возврат ТаблицаРезультата;
		КонецЕсли;
КонецФункции	

Функция ПолучитьФактБанк(Сотрудник,Банк, ВидПараметра, ПараметрВозвращения) Экспорт
	Если ВидПараметра = Перечисления.ТТ_Параметры_ЗП_Фин.БанкиСумма тогда
		Запрос = Новый Запрос;
		Запрос.Текст ="
		
		|ВЫБРАТЬ
		|РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка,
		|РабочийЛистКредитногоОтдела.ОбщаяСуммаКредита
		|ИЗ
		|Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|ГДЕ
		|РабочийЛистКредитногоОтдела.Дата МЕЖДУ &ДатаН И &ДатаК
		|И РабочийЛистКредитногоОтдела.Проведен = &Проведен
		|И РабочийЛистКредитногоОтдела.Банк = &Банк
		|И РабочийЛистКредитногоОтдела.Менеджер = &Менеджер
		|И РабочийЛистКредитногоОтдела.Статус = &Статус 
		|ИТОГИ
		|	Сумма(РабочийЛистКредитногоОтдела.ОбщаяСуммаКредита)
		|ПО
		|	ОБЩИЕ";

		Запрос.Параметры.Вставить("ДатаК",  КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
		Запрос.Параметры.Вставить("ДатаН", НачалоДня(ПериодНачало)); // <Дата>[01.01.0001 0:00:00]
		Запрос.Параметры.Вставить("Менеджер", Сотрудник); // <Сотрудники>[], Справочники.Сотрудники.ПустаяСсылка();
		Запрос.Параметры.Вставить("Проведен", Истина); // <Булево>[Нет]
		Запрос.Параметры.Вставить("Статус", Справочники.СтатусыРабочегоЛиста.Создан); // <Статусы рабочего листа>[], Справочники.СтатусыРабочегоЛиста.ПустаяСсылка();
		Запрос.Параметры.Вставить("Банк", Банк);
		
		Если ПараметрВозвращения = 1 тогда
			Рез=Запрос.Выполнить().Выбрать();
			Сумма=0;
			Пока Рез.Следующий() Цикл
				Сумма=Рез.ОбщаяСуммаКредита;
				Прервать;
			КонецЦикла;	
			Возврат Сумма
		ИначеЕсли ПараметрВозвращения =2 тогда
			ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
			Возврат ТаблицаРезультата;
		КонецЕсли;
		
	ИначеЕсли ВидПараметра = Перечисления.ТТ_Параметры_ЗП_Фин.БанкиШтуки тогда
		Запрос = Новый Запрос;
		Запрос.Текст ="
		
		|ВЫБРАТЬ
		|РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка
		|ИЗ
		|Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|ГДЕ
		|РабочийЛистКредитногоОтдела.Дата МЕЖДУ &ДатаН И &ДатаК
		|И РабочийЛистКредитногоОтдела.Проведен = &Проведен
		|И РабочийЛистКредитногоОтдела.Банк = &Банк
		|И РабочийЛистКредитногоОтдела.Менеджер = &Менеджер
		|И РабочийЛистКредитногоОтдела.Статус = &Статус 
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
		|ПО
		|	ОБЩИЕ";

		Запрос.Параметры.Вставить("ДатаК",  КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
		Запрос.Параметры.Вставить("ДатаН", НачалоДня(ПериодНачало)); // <Дата>[01.01.0001 0:00:00]
		Запрос.Параметры.Вставить("Менеджер", Сотрудник); // <Сотрудники>[], Справочники.Сотрудники.ПустаяСсылка();
		Запрос.Параметры.Вставить("Проведен", Истина); // <Булево>[Нет]
		Запрос.Параметры.Вставить("Статус", Справочники.СтатусыРабочегоЛиста.Создан); // <Статусы рабочего листа>[], Справочники.СтатусыРабочегоЛиста.ПустаяСсылка();
		Запрос.Параметры.Вставить("Банк", Банк);
		
		Если ПараметрВозвращения = 1 тогда
			Рез=Запрос.Выполнить().Выбрать();
			КолВо=0;
			Пока Рез.Следующий() Цикл
				КолВо=Рез.Ссылка;
				Прервать;
			КонецЦикла;	
			
			Возврат КолВо
		ИначеЕсли ПараметрВозвращения = 2 тогда
			ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
			Возврат ТаблицаРезультата;
		КонецЕсли;
	КонецЕсли;
	
	
КонецФункции	

Функция РасчитатьК_Программно(План,Факт)
	Процент=Окр(Факт/План,2)*100;
	Если Процент<80 Тогда
		К=0;
	ИначеЕсли Процент<90 Тогда	
		К=0.7;
	ИначеЕсли Процент<110 Тогда	
		К=1;
	ИначеЕсли Процент>110 Тогда	
		К=1.05;
	Иначе
		К=1;
	КонецЕсли;	
	
	Возврат К
КонецФункции

Функция РасчитатьК_ИЗРегистра(План,Факт, ЗаданныйПараметр)
	К = 0;
	Процент=Окр(Факт/План,2)*100;
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТ_Коэффициенты_ЗП_ФИНСрезПоследних.ПроцентMIN,
	|	ТТ_Коэффициенты_ЗП_ФИНСрезПоследних.ПроцентMAX,
	|	ТТ_Коэффициенты_ЗП_ФИНСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.ТТ_Коэффициенты_ЗП_ФИН.СрезПоследних(&НаДату, Параметр = &ЗаданныйПараметр) КАК ТТ_Коэффициенты_ЗП_ФИНСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ЗаданныйПараметр", ЗаданныйПараметр);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		Если Процент>=Выборка.ПроцентMIN и Процент<Выборка.ПроцентMax тогда
			К = Выборка.Коэффициент;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат К
	
КонецФункции	


Функция ПолучитьФактП(Бренд,Организация,Параметр,Сотрудник)
	
	Если Параметр=Перечисления.ТТ_Параметры_ЗП_Фин.АВКВ Тогда
		Сумма=РасчетАВКВ(Сотрудник,Бренд,Организация,1);
	ИначеЕсли Параметр=Перечисления.ТТ_Параметры_ЗП_Фин.ОСАГО Тогда
		Сумма=РасчетОСАГО(Сотрудник,1);	
	Иначе
		Сообщить("Неизвестный параметр");
	КонецЕсли;	
	
	Возврат Сумма
КонецФункции	

Функция РасчетОСАГО(Сотрудник,ПараметрВозвращения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	РабочийЛистОтделаСтрахования.Ссылка КАК Ссылка
				  |ИЗ
	              |	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахования
	              |ГДЕ
	              |	РабочийЛистОтделаСтрахования.Ссылка.Менеджер = &Менеджер
	              |	И РабочийЛистОтделаСтрахования.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
	              |	И РабочийЛистОтделаСтрахования.Ссылка.Статус = &Статус
	              |	И РабочийЛистОтделаСтрахования.Ссылка.Проведен = &Проведен
	              |	И РабочийЛистОтделаСтрахования.ВидСтрахования = &ВидСтрахования
	              |ИТОГИ
	              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
	              |ПО
	              |	ОБЩИЕ";
	Запрос.Параметры.Вставить("ДатаК",  КонецДня(ПериодКонец)); 
	Запрос.Параметры.Вставить("ДатаН", НачалоДня(ПериодНачало)); 
	Запрос.Параметры.Вставить("Менеджер", Сотрудник); 
	Запрос.Параметры.Вставить("Проведен", Истина); 
	Запрос.Параметры.Вставить("Статус", Справочники.СтатусыРабочегоЛиста.Создан); 
	Запрос.Параметры.Вставить("ВидСтрахования", Перечисления.ВидыСтрахования.ОСАГО); 	
	Если ПараметрВозвращения = 1 тогда
		Рез=Запрос.Выполнить().Выбрать();
		КолВо=0;
		Пока Рез.Следующий() Цикл
			КолВо=Рез.Ссылка; //итог первым, после него прервать
			Прервать;
		КонецЦикла;	
		Возврат КолВо
	ИначеЕсли ПараметрВозвращения = 2 тогда
		ТаблицаОСАГО = Запрос.Выполнить().Выгрузить();
		Возврат ТаблицаОСАГО;
	КонецЕсли;
	
КонецФункции	

Функция РасчетАВКВ(Сотрудник,Бренд,Организация,ПараметрВозвращения) Экспорт
	
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		              |	ВЫБОР
		              |		КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код <> ""ЦБ000017""
		              |			ТОГДА ВЫРАЗИТЬ(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии - РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии / 120 * 20 КАК ЧИСЛО(10, 2))
		              |		ИНАЧЕ РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии - РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		              |	КОНЕЦ КАК АВ,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
					  |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
					  |	СтраховойПолис.Ссылка КАК СтраховойПолис,
					  //    |	ЕСТЬNULL(РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Организация, РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация) КАК Поле1
					  |ЕСТЬNULL(РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Организация, РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация) КАК Организация,
					  |РабочийЛистОтделаСтрахованияВариантыСтрахования.ОбъектСтрахования КАК Модель
					  |ПОМЕСТИТЬ РабЛистыСтрах
					  |ИЗ
		              |	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		              |		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		              |			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		              |			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		              |ГДЕ
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		              |	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		              |	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		              |	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Менеджер = &Менеджер
		              |	И НЕ РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыСтрахования.GAP)
		              |	И (ЕСТЬNULL(РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Организация, РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация) = &Организация
		              |			ИЛИ &Организация = ЗНАЧЕНИЕ(СПРАВОЧНИК.Организации.ПустаяСсылка))
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		              |	СтраховойПолис.Ссылка,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		              |	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии,
		              |	ВЫБОР
		              |		КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код <> ""ЦБ000017""
		              |			ТОГДА ВЫРАЗИТЬ(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии - РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии / 120 * 20 КАК ЧИСЛО(10, 2))
					  |		ИНАЧЕ РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии - РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
					  |	КОНЕЦ,
					  //  |	ЕСТЬNULL(РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Организация, РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация)
					  |	ЕСТЬNULL(РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Организация, РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация),
					  |РабочийЛистОтделаСтрахованияВариантыСтрахования.ОбъектСтрахования
					  
					  |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	РабочийЛистКредитногоОтдела.Ссылка,
		              |	ВЫБОР
		              |		КОГДА РабочийЛистКредитногоОтдела.Организация.Код <> ""ЦБ000017""
		              |			ТОГДА ВЫРАЗИТЬ(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ - РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ / 120 * 20 КАК ЧИСЛО(10, 2))
		              |		ИНАЧЕ РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ - РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ
		              |	КОНЕЦ КАК КВ,
		              |	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		              |	Лизинг.Значение КАК Лизинг,
		              |	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		              |ПОМЕСТИТЬ РабЛистыКредитВТ
		              |ИЗ
		              |	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		              |		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		              |			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		              |		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		              |			И (Лизинг.Свойство.Код = ""02043"")
		              |ГДЕ
		              |	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		              |	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		              |	И РабочийЛистКредитногоОтдела.Статус = &Статус
		              |	И РабочийЛистКредитногоОтдела.Менеджер = &Менеджер
		              |	И (ЕСТЬNULL(РабочийЛистКредитногоОтдела.Ссылка.ДокументОснование.Организация, РабочийЛистКредитногоОтдела.Ссылка.Организация) = &Организация
		              |			ИЛИ &Организация = ЗНАЧЕНИЕ(СПРАВОЧНИК.Организации.ПустаяСсылка))
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	РабочийЛистКредитногоОтдела.Ссылка,
		              |	ЗначенияСвойствОбъектов.Значение,
		              |	Лизинг.Значение,
		              |	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела,
		              |	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель,
		              |	ВЫБОР
		              |		КОГДА РабочийЛистКредитногоОтдела.Организация.Код <> ""ЦБ000017""
		              |			ТОГДА ВЫРАЗИТЬ(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ - РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ / 120 * 20 КАК ЧИСЛО(10, 2))
		              |		ИНАЧЕ РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ - РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ
		              |	КОНЕЦ
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	ВЫБОР
		              |		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL
		              |			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		              |		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		              |	КОНЕЦ КАК Дата,
		              |	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		              |	ВЫБОР
		              |		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL
		              |			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		              |		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		              |	КОНЕЦ КАК Страхователь,
		              |	ВЫБОР
		              |		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		              |			ТОГДА ВЫБОР
		              |					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		              |						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		              |					ИНАЧЕ ВЫБОР
		              |							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		              |								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		              |							ИНАЧЕ ВЫБОР
		              |									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		              |										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		              |									ИНАЧЕ РабЛистыКредитВТ.Модель
		              |								КОНЕЦ
		              |						КОНЕЦ
		              |				КОНЕЦ
		              |		ИНАЧЕ ВЫБОР
		              |				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		              |					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		              |				ИНАЧЕ ВЫБОР
		              |						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		              |							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		              |						ИНАЧЕ ВЫБОР
		              |								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		              |									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		              |								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		              |							КОНЕЦ
		              |					КОНЕЦ
		              |			КОНЕЦ
		              |	КОНЕЦ КАК Марка,
		              //|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
					  |ЕСТЬNULL(РабЛистыСтрах.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
					  |	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		              |	ВЫБОР
		              |		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL
		              |			ТОГДА РабЛистыСтрах.АВ
		              |		ИНАЧЕ 0
		              |	КОНЕЦ КАК КВ,
		              |	ВЫБОР
		              |		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL
		              |			ТОГДА РабЛистыКредитВТ.КВ
		              |		ИНАЧЕ 0
		              |	КОНЕЦ КАК АВ,
		              |	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		              |	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		              |	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		              |ПОМЕСТИТЬ ВТ
		              |ИЗ
		              |	РабЛистыСтрах КАК РабЛистыСтрах
		              |		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		              |		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ВТ.Дата,
		              |	ВТ.ВидОперации,
		              |	ВТ.Страхователь,
		              |	ВТ.Марка,
		              |	ВТ.Модель,
		              |	ВТ.СуммаКредита,
		              |	ВТ.КВ,
		              |	ВТ.АВ,
		              |	ВТ.НомерПолиса,
		              |	ВТ.СсылкаСтрах,
		              |	ВТ.СсылкаКредит
		              |ИЗ
		              |	ВТ КАК ВТ &УсловиеПоМодели";
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Менеджер", Сотрудник);
		Если Не ЗначениеЗаполнено(Бренд) тогда
			ТекстУсловия = "";
            Запрос.Текст=СтрЗаменить(Запрос.Текст, "&УсловиеПоМодели", ТекстУсловия+Символы.ПС);
		Иначе
			ТекстУсловия = Символы.ПС + "ГДЕ ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
            Запрос.Текст=СтрЗаменить(Запрос.Текст, "&УсловиеПоМодели", ТекстУсловия+Символы.ПС);
			Запрос.УстановитьПараметр("Брэнд", ВернутьБренд(Бренд));
		КонецЕсли;
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ПараметрВозвращения = 1 тогда 
			Результат = Запрос.Выполнить();
			ВыборкаСсылка = Результат.Выбрать();
			СуммаФИН=0;
			Пока ВыборкаСсылка.Следующий() Цикл
				Если ВыборкаСсылка.АВ = 0 Тогда
					Сумма = Окр(ВыборкаСсылка.КВ,2);
				Иначе
					Сумма =Окр( ВыборкаСсылка.АВ,2);
				КонецЕсли;
				СуммаФИН=СуммаФИН+Сумма;
			КонецЦикла;
			Возврат СуммаФИН 
		ИначеЕсли ПараметрВозвращения = 2 тогда
			ТаблицаРезультатаАВКВ = Запрос.Выполнить().Выгрузить();
			Возврат ТаблицаРезультатаАВКВ
		КонецЕсли;
КонецФункции	

Функция ВернутьБренд(БрендДляПоказателей) Экспорт
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		СписокБрендов=Новый СписокЗначений;
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00000010"));
		Возврат СписокБрендов;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000025");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000006");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00003896");
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.VOLVO Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000146");			
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.FIAT Тогда
		СписокБрендов=Новый СписокЗначений;
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00003902"));
		Возврат СписокБрендов;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.FORD Тогда
		СписокБрендов=Новый СписокЗначений;
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00003901"));
		Возврат СписокБрендов;

	Иначе
		возврат справочники.Модели.ПустаяСсылка();		
	КонецЕсли;

КонецФункции
